import { Product } from '@/components/ui/card';

export const CATALOG_PRODUCTS: Product[] = [
  {
    id: '1',
    name: 'Профф марки ВА',
    description:
      'Предназначено для пенной и непенной мойки и дезинфекции внешней поверхности различных видов технологического оборудования, инвентаря, тары, полов, стен с использованием пеногенераторов, аппаратов высокого давления или ручным способом.',
    image: '/products/va.png',
    link: '/products/va',
    industry: 'dairy',
    productType: 'detergent',
  },
  {
    id: '2',
    name: 'Профф В',
    description:
      'Щелочное моющее средство для удаления смолистых загрязнений, нагара, следов от копчения с поверхностей газовых и электроплит, конвектоматов, грилей, облицовочной плитки, посуды.',
    image: '/products/v.png',
    link: '/products/v',
    industry: 'food',
    productType: 'detergent',
  },
  {
    id: '3',
    name: 'Профф БАРЬЕР',
    description:
      'Предназначено для дезинфекции помещений, различных поверхностей, оборудования, стен, полов; автотранспорта, въезжающего на территорию пищевых предприятий через дезбарьеры; обуви персонала и посетителей.',
    image: '/products/barier.png',
    link: '/products/barier',
    industry: 'brewing',
    productType: 'disinfectant',
  },
  {
    id: '4',
    name: 'Профф АКТИВ',
    description:
      'Слабощелочное пенное моющее средство с высокой степенью обезжиривания. Предназначено для бесконтактной и ручной мойки различных поверхностей, оборудования на предприятиях пищевой и не пищевой отраслей промышленности, объектах агропромышленного комплекса; для мытья транспорта.',
    image: '/products/active.png',
    link: '/products/active',
    industry: 'light-industry',
    productType: 'active-foam',
  },
    {
    id: '5',
    name: 'Профф марки ыв',
    description:
      'Предназначенывывыв дезинфекции внешней поверхности различных видов технологического оборудования, инвентаря, тары, полов, стен с использованием пеногенераторов, аппаратов высокого давления или ручным способом.',
    image: '/products/va.png',
    link: '/products/va',
    industry: 'metallurgy',
    productType: 'detergent',
  },
      {
    id: '6',
    name: 'Профф марки А1',
    description:
      'Предназначенывывыв дезинфекции внешней поверхности различных видов технологического оборудования, инвентаря, тары, полов, стен с использованием пеногенераторов, аппаратов высокого давления или ручным способом.',
    image: '/products/v.png',
    link: '/products/v',
    industry: 'dairy',
    productType: 'active-foam',
  },
        {
    id: '7',
    name: 'Профф марки А2',
    description:
      'Предназначенывывыв дезинфекции внешней поверхности различных видов технологического оборудования, инвентаря, тары, полов, стен с использованием пеногенераторов, аппаратов высокого давления или ручным способом.',
    image: '/products/barier.png',
    link: '/products/barier',
    industry: 'dairy',
    productType: 'active-foam',
  },
          {
    id: '8',
    name: 'Профф марки А3',
    description:
      'Предназначенывывыв дезинфекции внешней поверхности различных видов технологического оборудования, инвентаря, тары, полов, стен с использованием пеногенераторов, аппаратов высокого давления или ручным способом.',
    image: '/products/barier.png',
    link: '/products/barier',
    industry: 'metallurgy',
    productType: 'active-foam',
  },
            {
    id: '9',
    name: 'Профф марки А4',
    description:
      'Предназначенывывыв дезинфекции внешней поверхности различных видов технологического оборудования, инвентаря, тары, полов, стен с использованием пеногенераторов, аппаратов высокого давления или ручным способом.',
    image: '/products/barier.png',
    link: '/products/barier',
    industry: 'metallurgy',
    productType: 'active-foam',
  },
];